zephyrproject-rtos/hal_atmel/include/dt-bindings/pinctrl/samv70q-pinctrl.h
/* pc6b_tc2_tiob6 */
#define PC6B_TC2_TIOB6 \
	SAM_PINMUX(c, 6, b, periph)

/* pc7_gpio */
#define PC7_GPIO \
	SAM_PINMUX(c, 7, gpio, gpio)

/* pc7a_ebi_d7 */
#define PC7A_EBI_D7 \
	SAM_PINMUX(c, 7, a, periph)

/* pc7b_tc2_tclk6 */
#define PC7B_TC2_TCLK6 \
	SAM_PINMUX(c, 7, b, periph)

/* pc8_gpio */
#define PC8_GPIO \
	SAM_PINMUX(c, 8, gpio, gpio)

/* pc8a_ebi_nwe_nwr0 */
#define PC8A_EBI_NWE_NWR0 \
	SAM_PINMUX(c, 8, a, periph)

/* pc8b_tc2_tioa7 */
#define PC8B_TC2_TIOA7 \
	SAM_PINMUX(c, 8, b, periph)

/* pc9_gpio */
#define PC9_GPIO \
	SAM_PINMUX(c, 9, gpio, gpio)

/* pc9a_ebi_nandoe */
#define PC9A_EBI_NANDOE \
	SAM_PINMUX(c, 9, a, periph)

/* pc9b_tc2_tiob7 */
#define PC9B_TC2_TIOB7 \
	SAM_PINMUX(c, 9, b, periph)

/* pc10_gpio */
#define PC10_GPIO \
	SAM_PINMUX(c, 10, gpio, gpio)

/* pc10a_ebi_nandwe */
#define PC10A_EBI_NANDWE \
	SAM_PINMUX(c, 10, a, periph)

/* pc10b_tc2_tclk7 */
#define PC10B_TC2_TCLK7 \
	SAM_PINMUX(c, 10, b, periph)

/* pc11_gpio */
#define PC11_GPIO \
	SAM_PINMUX(c, 11, gpio, gpio)

/* pc11a_ebi_nrd */
#define PC11A_EBI_NRD \
	SAM_PINMUX(c, 11, a, periph)

/* pc11b_tc2_tioa8 */
#define PC11B_TC2_TIOA8 \
	SAM_PINMUX(c, 11, b, periph)

/* pc12_gpio */
#define PC12_GPIO \
	SAM_PINMUX(c, 12, gpio, gpio)

/* pc12a_ebi_ncs3 */
#define PC12A_EBI_NCS3 \
	SAM_PINMUX(c, 12, a, periph)

/* pc12b_tc2_tiob8 */
#define PC12B_TC2_TIOB8 \
	SAM_PINMUX(c, 12, b, periph)

/* pc12c_can1_rx */
#define PC12C_CAN1_RX \
	SAM_PINMUX(c, 12, c, periph)

/* pc12x_afe1_ad3 */
#define PC12X_AFE1_AD3 \
	SAM_PINMUX(c, 12, x, extra)

/* pc13_gpio */
#define PC13_GPIO \
	SAM_PINMUX(c, 13, gpio, gpio)

/* pc13a_ebi_nwait */
#define PC13A_EBI_NWAIT \
	SAM_PINMUX(c, 13, a, periph)

/* pc13b_pwmc0_pwmh3 */
#define PC13B_PWMC0_PWMH3 \
	SAM_PINMUX(c, 13, b, periph)

/* pc13c_ebi_sda10 */
#define PC13C_EBI_SDA10 \
	SAM_PINMUX(c, 13, c, periph)

/* pc13x_afe1_ad1 */
#define PC13X_AFE1_AD1 \
	SAM_PINMUX(c, 13, x, extra)

/* pc14_gpio */
#define PC14_GPIO \
	SAM_PINMUX(c, 14, gpio, gpio)

/* pc14a_ebi_ncs0 */
#define PC14A_EBI_NCS0 \
	SAM_PINMUX(c, 14, a, periph)

/* pc14b_tc2_tclk8 */
#define PC14B_TC2_TCLK8 \
	SAM_PINMUX(c, 14, b, periph)

/* pc14c_can1_tx */
#define PC14C_CAN1_TX \
	SAM_PINMUX(c, 14, c, periph)

/* pc15_gpio */
#define PC15_GPIO \
	SAM_PINMUX(c, 15, gpio, gpio)

/* pc15a_ebi_ncs1_sdcs */
#define PC15A_EBI_NCS1_SDCS \
	SAM_PINMUX(c, 15, a, periph)

/* pc15b_pwmc0_pwml3 */
#define PC15B_PWMC0_PWML3 \
	SAM_PINMUX(c, 15, b, periph)

/* pc15x_afe1_ad2 */
#define PC15X_AFE1_AD2 \
	SAM_PINMUX(c, 15, x, extra)

/* pc16_gpio */
#define PC16_GPIO \
	SAM_PINMUX(c, 16, gpio, gpio)

/* pc16a_ebi_a21_nandale */
#define PC16A_EBI_A21_NANDALE \
	SAM_PINMUX(c, 16, a, periph)

/* pc17_gpio */
#define PC17_GPIO \
	SAM_PINMUX(c, 17, gpio, gpio)

/* pc17a_ebi_a22_nandcle */
#define PC17A_EBI_A22_NANDCLE \
	SAM_PINMUX(c, 17, a, periph)

/* pc18_gpio */
#define PC18_GPIO \
	SAM_PINMUX(c, 18, gpio, gpio)

/* pc18a_ebi_a0_nbs0 */
#define PC18A_EBI_A0_NBS0 \
	SAM_PINMUX(c, 18, a, periph)

/* pc18b_pwmc0_pwml1 */
#define PC18B_PWMC0_PWML1 \
	SAM_PINMUX(c, 18, b, periph)

/* pc19_gpio */
#define PC19_GPIO \
	SAM_PINMUX(c, 19, gpio, gpio)

/* pc19a_ebi_a1 */
#define PC19A_EBI_A1 \
	SAM_PINMUX(c, 19, a, periph)

/* pc19b_pwmc0_pwmh2 */
#define PC19B_PWMC0_PWMH2 \
	SAM_PINMUX(c, 19, b, periph)

/* pc20_gpio */
#define PC20_GPIO \
	SAM_PINMUX(c, 20, gpio, gpio)

/* pc20a_ebi_a2 */
#define PC20A_EBI_A2 \
	SAM_PINMUX(c, 20, a, periph)

/* pc20b_pwmc0_pwml2 */
#define PC20B_PWMC0_PWML2 \
	SAM_PINMUX(c, 20, b, periph)

/* pc21_gpio */
#define PC21_GPIO \
	SAM_PINMUX(c, 21, gpio, gpio)

/* pc21a_ebi_a3 */
#define PC21A_EBI_A3 \
	SAM_PINMUX(c, 21, a, periph)

/* pc21b_pwmc0_pwmh3 */
#define PC21B_PWMC0_PWMH3 \
	SAM_PINMUX(c, 21, b, periph)

/* pc22_gpio */
#define PC22_GPIO \
	SAM_PINMUX(c, 22, gpio, gpio)

/* pc22a_ebi_a4 */
#define PC22A_EBI_A4 \
	SAM_PINMUX(c, 22, a, periph)

/* pc22b_pwmc0_pwml3 */
#define PC22B_PWMC0_PWML3 \
	SAM_PINMUX(c, 22, b, periph)

/* pc23_gpio */
#define PC23_GPIO \
	SAM_PINMUX(c, 23, gpio, gpio)

/* pc23a_ebi_a5 */
#define PC23A_EBI_A5 \
	SAM_PINMUX(c, 23, a, periph)

/* pc23b_tc1_tioa3 */
#define PC23B_TC1_TIOA3 \
	SAM_PINMUX(c, 23, b, periph)

/* pc24_gpio */
#define PC24_GPIO \
	SAM_PINMUX(c, 24, gpio, gpio)

/* pc24a_ebi_a6 */
#define PC24A_EBI_A6 \
	SAM_PINMUX(c, 24, a, periph)

/* pc24b_tc1_tiob3 */
#define PC24B_TC1_TIOB3 \
	SAM_PINMUX(c, 24, b, periph)

/* pc24c_spi1_spck */
#define PC24C_SPI1_SPCK \
	SAM_PINMUX(c, 24, c, periph)

/* pc25_gpio */
#define PC25_GPIO \
	SAM_PINMUX(c, 25, gpio, gpio)

/* pc25a_ebi_a7 */
#define PC25A_EBI_A7 \
	SAM_PINMUX(c, 25, a, periph)

/* pc25b_tc1_tclk3 */
#define PC25B_TC1_TCLK3 \
	SAM_PINMUX(c, 25, b, periph)

/* pc25c_spi1_npcs0 */
#define PC25C_SPI1_NPCS0 \
	SAM_PINMUX(c, 25, c, periph)

/* pc26_gpio */
#define PC26_GPIO \
	SAM_PINMUX(c, 26, gpio, gpio)

/* pc26a_ebi_a8 */
#define PC26A_EBI_A8 \
	SAM_PINMUX(c, 26, a, periph)

/* pc26b_tc1_tioa4 */
#define PC26B_TC1_TIOA4 \
	SAM_PINMUX(c, 26, b, periph)

/* pc26c_spi1_miso */
#define PC26C_SPI1_MISO \
	SAM_PINMUX(c, 26, c, periph)

/* pc26x_afe1_ad7 */
#define PC26X_AFE1_AD7 \
	SAM_PINMUX(c, 26, x, extra)

/* pc27_gpio */
#define PC27_GPIO \
	SAM_PINMUX(c, 27, gpio, gpio)

/* pc27a_ebi_a9 */
#define PC27A_EBI_A9 \
	SAM_PINMUX(c, 27, a, periph)

/* pc27b_tc1_tiob4 */
#define PC27B_TC1_TIOB4 \
	SAM_PINMUX(c, 27, b, periph)

/* pc27c_spi1_mosi */
#define PC27C_SPI1_MOSI \
	SAM_PINMUX(c, 27, c, periph)

/* pc27x_afe1_ad8 */
#define PC27X_AFE1_AD8 \
	SAM_PINMUX(c, 27, x, extra)

/* pc28_gpio */
#define PC28_GPIO \
	SAM_PINMUX(c, 28, gpio, gpio)

/* pc28a_ebi_a10 */
#define PC28A_EBI_A10 \
	SAM_PINMUX(c, 28, a, periph)

/* pc28b_tc1_tclk4 */
#define PC28B_TC1_TCLK4 \
	SAM_PINMUX(c, 28, b, periph)

/* pc28c_spi1_npcs1 */
#define PC28C_SPI1_NPCS1 \
	SAM_PINMUX(c, 28, c, periph)

/* pc29_gpio */
#define PC29_GPIO \
	SAM_PINMUX(c, 29, gpio, gpio)

/* pc29a_ebi_a11 */
#define PC29A_EBI_A11 \
	SAM_PINMUX(c, 29, a, periph)

/* pc29b_tc1_tioa5 */
#define PC29B_TC1_TIOA5 \
	SAM_PINMUX(c, 29, b, periph)

/* pc29c_spi1_npcs2 */
#define PC29C_SPI1_NPCS2 \
	SAM_PINMUX(c, 29, c, periph)

/* pc29x_afe1_ad4 */
#define PC29X_AFE1_AD4 \
	SAM_PINMUX(c, 29, x, extra)

/* pc30_gpio */
#define PC30_GPIO \
	SAM_PINMUX(c, 30, gpio, gpio)

