zephyrproject-rtos/hal_atmel/include/dt-bindings/pinctrl/samv70q-pinctrl.h
/* pd20a_pwmc0_pwmh0 */
#define PD20A_PWMC0_PWMH0 \
	SAM_PINMUX(d, 20, a, periph)

/* pd20b_spi0_miso */
#define PD20B_SPI0_MISO \
	SAM_PINMUX(d, 20, b, periph)

/* pd21_gpio */
#define PD21_GPIO \
	SAM_PINMUX(d, 21, gpio, gpio)

/* pd21a_pwmc0_pwmh1 */
#define PD21A_PWMC0_PWMH1 \
	SAM_PINMUX(d, 21, a, periph)

/* pd21b_spi0_mosi */
#define PD21B_SPI0_MOSI \
	SAM_PINMUX(d, 21, b, periph)

/* pd21c_tc3_tioa11 */
#define PD21C_TC3_TIOA11 \
	SAM_PINMUX(d, 21, c, periph)

/* pd21d_isi_d1 */
#define PD21D_ISI_D1 \
	SAM_PINMUX(d, 21, d, periph)

/* pd22_gpio */
#define PD22_GPIO \
	SAM_PINMUX(d, 22, gpio, gpio)

/* pd22a_pwmc0_pwmh2 */
#define PD22A_PWMC0_PWMH2 \
	SAM_PINMUX(d, 22, a, periph)

/* pd22b_spi0_spck */
#define PD22B_SPI0_SPCK \
	SAM_PINMUX(d, 22, b, periph)

/* pd22c_tc3_tiob11 */
#define PD22C_TC3_TIOB11 \
	SAM_PINMUX(d, 22, c, periph)

/* pd22d_isi_d0 */
#define PD22D_ISI_D0 \
	SAM_PINMUX(d, 22, d, periph)

/* pd23_gpio */
#define PD23_GPIO \
	SAM_PINMUX(d, 23, gpio, gpio)

/* pd23a_pwmc0_pwmh3 */
#define PD23A_PWMC0_PWMH3 \
	SAM_PINMUX(d, 23, a, periph)

/* pd23c_ebi_sdck */
#define PD23C_EBI_SDCK \
	SAM_PINMUX(d, 23, c, periph)

/* pd24_gpio */
#define PD24_GPIO \
	SAM_PINMUX(d, 24, gpio, gpio)

/* pd24a_pwmc0_pwml0 */
#define PD24A_PWMC0_PWML0 \
	SAM_PINMUX(d, 24, a, periph)

/* pd24b_ssc_rf */
#define PD24B_SSC_RF \
	SAM_PINMUX(d, 24, b, periph)

/* pd24c_tc3_tclk11 */
#define PD24C_TC3_TCLK11 \
	SAM_PINMUX(d, 24, c, periph)

/* pd24d_isi_hsync */
#define PD24D_ISI_HSYNC \
	SAM_PINMUX(d, 24, d, periph)

/* pd25_gpio */
#define PD25_GPIO \
	SAM_PINMUX(d, 25, gpio, gpio)

/* pd25a_pwmc0_pwml1 */
#define PD25A_PWMC0_PWML1 \
	SAM_PINMUX(d, 25, a, periph)

/* pd25b_spi0_npcs1 */
#define PD25B_SPI0_NPCS1 \
	SAM_PINMUX(d, 25, b, periph)

/* pd25c_uart2_rxd */
#define PD25C_UART2_RXD \
	SAM_PINMUX(d, 25, c, periph)

/* pd25d_isi_vsync */
#define PD25D_ISI_VSYNC \
	SAM_PINMUX(d, 25, d, periph)

/* pd26_gpio */
#define PD26_GPIO \
	SAM_PINMUX(d, 26, gpio, gpio)

/* pd26a_pwmc0_pwml2 */
#define PD26A_PWMC0_PWML2 \
	SAM_PINMUX(d, 26, a, periph)

/* pd26b_ssc_td */
#define PD26B_SSC_TD \
	SAM_PINMUX(d, 26, b, periph)

/* pd26c_uart2_txd */
#define PD26C_UART2_TXD \
	SAM_PINMUX(d, 26, c, periph)

/* pd26d_uart1_txd */
#define PD26D_UART1_TXD \
	SAM_PINMUX(d, 26, d, periph)

/* pd27_gpio */
#define PD27_GPIO \
	SAM_PINMUX(d, 27, gpio, gpio)

/* pd27a_pwmc0_pwml3 */
#define PD27A_PWMC0_PWML3 \
	SAM_PINMUX(d, 27, a, periph)

/* pd27b_spi0_npcs3 */
#define PD27B_SPI0_NPCS3 \
	SAM_PINMUX(d, 27, b, periph)

/* pd27c_twi2_twd */
#define PD27C_TWI2_TWD \
	SAM_PINMUX(d, 27, c, periph)

/* pd27d_isi_d8 */
#define PD27D_ISI_D8 \
	SAM_PINMUX(d, 27, d, periph)

/* pd28_gpio */
#define PD28_GPIO \
	SAM_PINMUX(d, 28, gpio, gpio)

/* pd28a_uart3_rxd */
#define PD28A_UART3_RXD \
	SAM_PINMUX(d, 28, a, periph)

/* pd28b_can1_rx */
#define PD28B_CAN1_RX \
	SAM_PINMUX(d, 28, b, periph)

/* pd28c_twi2_twck */
#define PD28C_TWI2_TWCK \
	SAM_PINMUX(d, 28, c, periph)

/* pd28d_isi_d9 */
#define PD28D_ISI_D9 \
	SAM_PINMUX(d, 28, d, periph)

/* pd28x_supc_wkup5 */
#define PD28X_SUPC_WKUP5 \
	SAM_PINMUX(d, 28, wkup5, wakeup)

/* pd29_gpio */
#define PD29_GPIO \
	SAM_PINMUX(d, 29, gpio, gpio)

/* pd29c_ebi_sdwe */
#define PD29C_EBI_SDWE \
	SAM_PINMUX(d, 29, c, periph)

/* pd30_gpio */
#define PD30_GPIO \
	SAM_PINMUX(d, 30, gpio, gpio)

/* pd30a_uart3_txd */
#define PD30A_UART3_TXD \
	SAM_PINMUX(d, 30, a, periph)

/* pd30d_isi_d10 */
#define PD30D_ISI_D10 \
	SAM_PINMUX(d, 30, d, periph)

/* pd30x_afe0_ad0 */
#define PD30X_AFE0_AD0 \
	SAM_PINMUX(d, 30, x, extra)

/* pd31_gpio */
#define PD31_GPIO \
	SAM_PINMUX(d, 31, gpio, gpio)

/* pd31a_qspi_qio3 */
#define PD31A_QSPI_QIO3 \
	SAM_PINMUX(d, 31, a, periph)

/* pd31b_uart3_txd */
#define PD31B_UART3_TXD \
	SAM_PINMUX(d, 31, b, periph)

/* pd31c_pmc_pck2 */
#define PD31C_PMC_PCK2 \
	SAM_PINMUX(d, 31, c, periph)

/* pd31d_isi_d11 */
#define PD31D_ISI_D11 \
	SAM_PINMUX(d, 31, d, periph)

/* pe0_gpio */
#define PE0_GPIO \
	SAM_PINMUX(e, 0, gpio, gpio)

/* pe0a_ebi_d8 */
#define PE0A_EBI_D8 \
	SAM_PINMUX(e, 0, a, periph)

/* pe0b_tc3_tioa9 */
#define PE0B_TC3_TIOA9 \
	SAM_PINMUX(e, 0, b, periph)

/* pe0c_i2sc1_ws */
#define PE0C_I2SC1_WS \
	SAM_PINMUX(e, 0, c, periph)

/* pe0x_afe1_ad11 */
#define PE0X_AFE1_AD11 \
	SAM_PINMUX(e, 0, x, extra)

/* pe1_gpio */
#define PE1_GPIO \
	SAM_PINMUX(e, 1, gpio, gpio)

/* pe1a_ebi_d9 */
#define PE1A_EBI_D9 \
	SAM_PINMUX(e, 1, a, periph)

/* pe1b_tc3_tiob9 */
#define PE1B_TC3_TIOB9 \
	SAM_PINMUX(e, 1, b, periph)

/* pe1c_i2sc1_do */
#define PE1C_I2SC1_DO \
	SAM_PINMUX(e, 1, c, periph)

/* pe2_gpio */
#define PE2_GPIO \
	SAM_PINMUX(e, 2, gpio, gpio)

/* pe2a_ebi_d10 */
#define PE2A_EBI_D10 \
	SAM_PINMUX(e, 2, a, periph)

/* pe2b_tc3_tclk9 */
#define PE2B_TC3_TCLK9 \
	SAM_PINMUX(e, 2, b, periph)

/* pe2c_i2sc1_di */
#define PE2C_I2SC1_DI \
	SAM_PINMUX(e, 2, c, periph)

/* pe3_gpio */
#define PE3_GPIO \
	SAM_PINMUX(e, 3, gpio, gpio)

/* pe3a_ebi_d11 */
#define PE3A_EBI_D11 \
	SAM_PINMUX(e, 3, a, periph)

/* pe3b_tc3_tioa10 */
#define PE3B_TC3_TIOA10 \
	SAM_PINMUX(e, 3, b, periph)

/* pe3x_afe1_ad10 */
#define PE3X_AFE1_AD10 \
	SAM_PINMUX(e, 3, x, extra)

/* pe4_gpio */
#define PE4_GPIO \
	SAM_PINMUX(e, 4, gpio, gpio)

/* pe4a_ebi_d12 */
#define PE4A_EBI_D12 \
	SAM_PINMUX(e, 4, a, periph)

/* pe4b_tc3_tiob10 */
#define PE4B_TC3_TIOB10 \
	SAM_PINMUX(e, 4, b, periph)

/* pe4x_afe0_ad4 */
#define PE4X_AFE0_AD4 \
	SAM_PINMUX(e, 4, x, extra)

/* pe5_gpio */
#define PE5_GPIO \
	SAM_PINMUX(e, 5, gpio, gpio)

/* pe5a_ebi_d13 */
#define PE5A_EBI_D13 \
	SAM_PINMUX(e, 5, a, periph)

/* pe5b_tc3_tclk10 */
#define PE5B_TC3_TCLK10 \
	SAM_PINMUX(e, 5, b, periph)

/* pe5x_afe1_ad3 */
#define PE5X_AFE1_AD3 \
	SAM_PINMUX(e, 5, x, extra)
